# CannotComputeRailingsElevationError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..CannotComputeRailingsElevationError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Can't compute Railings Elevation Profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotComputeRailingsElevationError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotComputeRailingsElevationError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotComputeRailingsElevationError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace